app/Controllers/Admin/Customer.php

SELECT *
FROM `user`
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
---
    public function index()
    {
        $email = $this->session->get('email');
        $customer = $this->db->table("user")
        ->get()
        ->getResultArray();
        $data = [
            'user' => $this->db->table("user")->where("email", $email)->get()->getRowArray(),
            "customer" => $customer
        ];