app/Controllers/Admin/Laptop.php

SELECT *
FROM `laptop`
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
---
    public function index()
    {
        $email = $this->session->get('email');
        $laptop = $this->db->table("laptop")
        ->get()
        ->getResultArray();
        $data = [
            'user' => $this->db->table("user")->where("email", $email)->get()->getRowArray(),
            "laptop" => $laptop
        ];