app/Controllers/Admin/Transaksi.php

    public function index()
    {
        $email = $this->session->get('email');
        $data["transaksi"] = $this->db->table("transaksi t")
        ->join("laptop l",
            "l.id_laptop = t.id_laptop"
        , "LEFT")
        ->select("
            t.id_rental,
            l.id_laptop,
            CONCAT(l.merk, ' ', l.seri) laptop,
            t.jumlah_pinjam,
            (l.harga * t.jumlah_pinjam) total_harga
        ")
        ->where("status_rental='1'")
        ->get()
        ->getResultArray();
        $data['user'] = $this->db->table("user")->where("email", $email)->get()->getRowArray();
---
SELECT `t`.`id_rental`, `l`.`id_laptop`, CONCAT(l.merk, ' ', l.seri) laptop, `t`.`jumlah_pinjam`, (l.harga * t.jumlah_pinjam) total_harga
FROM `transaksi` `t`
LEFT JOIN `laptop` `l` ON `l`.`id_laptop` = `t`.`id_laptop`
WHERE `status_rental` = '1'
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'