app/Models/Customer/Katalog_model.php

SELECT *
FROM `user`
WHERE `email` = 'test@mail.com'
---
    public function get_user($email)
    {

        return $this->db->table('user')->getwhere(['email' => $email])->getRowArray();

SELECT *
FROM `laptop`
JOIN `multiple` ON `multiple`.`id_upload` = `laptop`.`id_upload`
WHERE `nama_tipe` = 'bisnis'
AND `sampul` = 1
AND `jumlah` != 0
---
    public function get_laptop_bisnis($bisnis, $q="")
    {

        $laptop = $this->db->table('laptop')
            ->join('multiple', 'multiple.id_upload = laptop.id_upload')
            ->where('nama_tipe', $bisnis)
            ->where('sampul', 1)
            ->where('jumlah !=', 0);
        if (!empty($q))
        {
            $laptop = $laptop->like("merk", $q)->orLike("seri", $q)->orLike("prosesor", $q)->orLike("ram", $q)->orLike("penyimpanan", $q);
        }
        return $laptop->get()
            ->getResultArray();

SELECT *
FROM `laptop`
JOIN `multiple` ON `multiple`.`id_upload` = `laptop`.`id_upload`
WHERE `nama_tipe` = 'gaming'
AND `sampul` = 1
AND `jumlah` != 0
---
    public function get_laptop_gaming($gaming, $q = "")
    {

        $laptop =  $this->db->table('laptop')
            ->join('multiple', 'multiple.id_upload = laptop.id_upload')
            ->where('nama_tipe', $gaming)
            ->where('sampul', 1)
            ->where('jumlah !=', 0);
        if (!empty($q))
        {
            $laptop = $laptop->like("merk", $q)->orLike("seri", $q)->orLike("prosesor", $q)->orLike("ram", $q)->orLike("penyimpanan", $q);
        }

        return $laptop->get()
            ->getResultArray();

SELECT *
FROM `laptop`
JOIN `multiple` ON `multiple`.`id_upload` = `laptop`.`id_upload`
WHERE `nama_tipe` = 'multimedia'
AND `sampul` = 1
AND `jumlah` != 0
---
    public function get_laptop_multimedia($multimedia, $q = "")
    {

        $laptop = $this->db->table('laptop')
            ->join('multiple', 'multiple.id_upload = laptop.id_upload')
            ->where('nama_tipe', $multimedia)
            ->where('sampul', 1)
            ->where('jumlah !=', 0);
        if (!empty($q))
        {
            $laptop = $laptop->like("merk", $q)->orLike("seri", $q)->orLike("prosesor", $q)->orLike("ram", $q)->orLike("penyimpanan", $q);
        }
        return $laptop->get()
            ->getResultArray();

SELECT *
FROM `laptop`
JOIN `multiple` ON `multiple`.`id_upload` = `laptop`.`id_upload`
WHERE `nama_tipe` = 'ultrabook'
AND `sampul` = 1
AND `jumlah` != 0
---
    public function get_laptop_ultra($ultra, $q = "")
    {

        $laptop = $this->db->table('laptop')
            ->join('multiple', 'multiple.id_upload = laptop.id_upload')
            ->where('nama_tipe', $ultra)
            ->where('sampul', 1)
            ->where('jumlah !=', 0);
        if (!empty($q))
        {
            $laptop = $laptop->like("merk", $q)->orLike("seri", $q)->orLike("prosesor", $q)->orLike("ram", $q)->orLike("penyimpanan", $q);
        }
        return $laptop->get()
            ->getResultArray();