app/Models/Customer/Transaksi_model.php

    public function numrows_cart($email)
    {
        return $this->db->table('transaksi')
            ->selectCount('customer', 'numrows')
            ->getWhere(['customer' => $email])
            ->getRowArray();
---
SELECT COUNT(`customer`) AS `numrows`
FROM `transaksi`
WHERE `customer` = 'test@mail.com'