app/Models/Admin/Auth_model.php

SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
---
    public function get_user($email)
    {

        return $this->db->table('user')->getwhere(['email' => $email])->getRowArray();