app/Models/Admin/Data_laptop_model.php

    public function get_user($email)
    {

        return $this->db->table('user')->getwhere(['email' => $email])->getRowArray();
---
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'