app/Controllers/Profile.php

SELECT *
FROM `user`
WHERE `email` = 'test@mail.com'
---
    public function index()
    {
        $email = $this->session->get("email");
        if (empty($email)) {
            return redirect()->to(base_url('/'));
        }

        $data["judul"] = "Profile";
        $data["user"] = $this->db->table("user")->where(["email" => $email])
        ->get()
        ->getRowArray();